#+title: [Reading] A CLOS Protocol for Editor Buffers
#+date: 2025-08-05
#+layout: post
#+math: true
#+options: _:nil ^:nil
#+categories: lisp
**** =(print-object zipper stream)=
这里用类似 =#<unfold cursor folded>= 的形式来显示 =zipper= 数据结构:

#+name: print-object.zipper
#+begin_src lisp
  (defmethod print-object ((zipper zipper) stream)
    (print-unreadable-object (zipper stream)
      (format stream "~A ~A ~A"
              (zipper-unfold zipper)
              (zipper-cursor zipper)
              (zipper-folded zipper))))
#+end_src

例:

#+begin_src lisp :tangle no :results replace :exports both
  (zipper<- "Hello World")
#+end_src

#+RESULTS:
: #<nil H (e l l o   W o r l d)>

